MODULES = {   # модули
  'Б1.О.01' : 'Методология исследования в образовании',
  'Б1.О.02' : 'Профессиональная коммуникация',
  'Б1.О.03' : 'Проектирование и управление образовательным процессом',
  'Б1.О.04' : 'Образование и общество',
  'Б1.В.01' : 'Современное высшее образование',
  'Б1.В.02' : 'Деятельность преподавателя высшей школы',
  'Б1.В.03' : 'Взаимодействие субъектов образовательного процесса в вузе'
}

SUBJECTS = {  # дисциплины модулей
  'Б1.О.01.01' : 'Современные проблемы науки и образования',
  'Б1.О.01.02' : 'Методология и методы научного исследования',
  'Б1.О.01.03' : 'Теория аргументации в исследовательской деятельности',
  'Б1.О.01.04' : 'Применение наукометрических баз в исследовании проблем образования',
  'Б1.О.02.01' : 'Иностранный язык в профессиональной коммуникации',
  'Б1.О.02.02' : 'Информационные технологии в профессиональной деятельности',
  'Б1.О.02.03' : 'Русский язык в профессиональной сфере',
  'Б1.О.03.01' : 'Управление проектами в образовательной деятельности',
  'Б1.О.03.02' : 'Проектирование основных и дополнительных образовательных программ',
  'Б1.О.03.03' : 'Технологии проектирования индивидуальных образовательных маршрутов обучающихся',
  'Б1.О.03.04' : 'Практикум по проектированию психологически безопасной среды',
  'Б1.О.04.01' : 'Государственная политика в области образования',
  'Б1.О.04.02' : 'Философия современного образования',
  'Б1.О.04.03' : 'Ценностно-целевые ориентиры современного воспитания',
  'Б1.В.01.01' : 'Развитие высшего образования за рубежом и в России',
  'Б1.В.01.02' : 'Непрерывное педагогическое образование',
  'Б1.В.01.03' : 'Цифровая трансформация высшего образования',
  'Б1.В.02.01' : 'Профессиональная деятельность преподавателя высшей школы',
  'Б1.В.02.02' : 'Профессиональное саморазвитие вузовского преподавателя',
  'Б1.В.03.01' : 'Педагогическое сопровождение профессионального саморазвития студента вуза'
}

COMPETENCES = {   # компетенции
  'УК-1' : 'Способен осуществлять критический анализ проблемных ситуаций на основе системного подхода, вырабатывать стратегию действий',
  'УК-2' : 'Способен управлять проектом на всех этапах его жизненного цикла',
  'УК-3' : 'Способен организовать и руководить работой команды, вырабатывая командную стратегию для достижения поставленной цели',
  'УК-4' : 'Способен применять современные коммуникативные технологии, в том числе на иностранном(ых) языке(ах), для академического и профессионального взаимодействия',
  'УК-5' : 'Способен анализировать и учитывать разнообразие культур в процессе межкультурного взаимодействия',
  'УК-6' : 'Способен определять и реализовывать приоритеты собственной деятельности и способы ее совершенствования на основе самооценки',
  'ОПК-1' : 'Способен осуществлять и оптимизировать профессиональную деятельность в соответствии с нормативно-правовыми актами в сфере образования и нормами профессиональной этики',
  'ОПК-2' : 'Способен проектировать основные и дополнительные образовательные программы и разрабатывать научно-методическое обеспечение их реализации',
  'ОПК-3' : 'Способен проектировать организацию совместной и индивидуальной учебной и воспитательной деятельности обучающихся, в том числе с особыми образовательными потребностями',
  'ОПК-4' : 'Способен создавать и реализовывать условия и принципы духовно-нравственного воспитания обучающихся на основе базовых национальных ценностей',
  'ОПК-5' : 'Способен разрабатывать программы мониторинга результатов образования обучающихся, разрабатывать и реализовывать программы преодоления трудностей в обучении',
  'ОПК-6' : 'Способен проектировать и использовать эффективные психолого-педагогические, в том числе инклюзивные, технологии в профессиональной деятельности, необходимые для индивидуализации обучения, развития, воспитания обучающихся с особыми образовательными потребностями',
  'ОПК-7' : 'Способен планировать и организовывать взаимодействия участников образовательных отношений',
  'ОПК-8' : 'Способен проектировать педагогическую деятельность на основе специальных научных знаний и результатов исследований',
  'ПК-1' : 'Способен нести ответственность за собственную профессиональную компетентность по профилю осваиваемой образовательной программы',
  'ПК-2' : 'Способен вести совместно с другими участниками исследовательскую деятельность в рамках выбранной проблематики',
  'ПК-3' : 'Способен проектировать, организовывать и оценивать образовательный процесс с использованием форм, методов, образовательных технологий и оценочных средств, соответствующих  актуальным требованиями, предъявляемым к программам высшего образования и дополнительного профессионального образования со стороны государства, работодателей и обучающихся',
  'ПК-4' : 'Способен организовать педагогическое сопровождение  профессионального становления обучающихся по программам высшего образования.',
  'ПК-5' : 'Способен планировать  и реализовывать   непрерывное профессиональное саморазвитие преподавателя высшей школы'
}

INDICATORS = {  # индикаторы компетенция
  'ИУК-1.1' : 'Выявляет проблемную ситуацию в процессе анализа проблемы, определяет этапы ее разрешения с учетом вариативных контекстов',
  'ИУК-1.2' : 'Находит, критически анализирует и выбирает информацию, необходимую для выработки стратегий действий по решению проблемной ситуации',
  'ИУК-1.3' : 'Рассматривает различные варианты решения проблемной ситуации на основе системного подхода, оценивает их преимущества и риски',
  'ИУК-1.4' : 'Грамотно, логично, аргументированно формулирует собственные суждения и оценки. Предлагает стратегию действий',
  'ИУК-1.5' : 'Определяет и оценивает практические последствия реализации действий по разрешению проблемной ситуации',
  'ИУК-2.1' : 'Выстраивает этапы работы над проектом с учетом последовательности их реализации, определяет этапы жизненного цикла проекта',
  'ИУК-2.2' : 'Определяет проблему, на решение которой направлен проект, грамотно формулирует цель проекта. Определяет исполнителей проекта.',
  'ИУК-2.3' : 'Проектирует решение конкретных задач проекта, выбирая оптимальный способ их решения, исходя из действующих правовых норм и имеющихся ресурсов и ограничений',
  'ИУК-2.4' : 'Качественно решает конкретные задачи (исследования, проекта, деятельности) за установленное время. Оценивает риски и результаты проекта',
  'ИУК-2.5' : 'Публично представляет результаты проекта, вступает в обсуждение хода и результатов проекта',
  'ИУК-3.1' : 'Понимает эффективность использования стратегии сотрудничества для достижения поставленной цели, определяет роль каждого участника в команде',
  'ИУК-3.2' : 'Учитывает в совместной деятельности особенности поведения и общения разных людей',
  'ИУК-3.3' : 'Способен устанавливать разные виды коммуникаций (устную, письменную, вербальную, невербальную, реальную, виртуальную, межличностную и др.) для руководства командой и достижения поставленной цели',
  'ИУК-3.4' : 'Демонстрирует понимание результатов (последствий) личных действий и планирует последовательность шагов для достижения цели, контролирует их выполнение',
  'ИУК-3.5' : 'Эффективно взаимодействует с членами команды, в т.ч. участвует в обмене информацией, знаниями и опытом, и презентации результатов работы команды. Соблюдает этические нормы взаимодействия',
  'ИУК-4.1' : 'Выбирает на государственном и иностранном (-ых) языках коммуникативно приемлемые стили делового общения, вербальные и невербальные средства взаимодействия с партнерами',
  'ИУК-4.2' : 'Использует информационно-коммуникационные технологии при поиске необходимой информации в процессе решения различных коммуникативных задач на государственном и иностранном (-ых) языках',
  'ИУК-4.3' : 'Ведет деловую переписку, учитывая особенности стилистики официальных и неофициальных писем, социокультурные различия в формате корреспонденции на государственном и иностранном (-ых) языках',
  'ИУК-4.4' : 'Умеет коммуникативно и культурно приемлемо вести устные деловые разговоры в процессе профессионального взаимодействия на государственном и иностранном (-ых) языках',
  'ИУК-4.5' : 'Демонстрирует умение выполнять перевод академических и профессиональных текстов с иностранного (-ых) на государственный язык',
  'ИУК-5.1' : 'Находит и использует необходимую для саморазвития и взаимодействия с другими информацию о культурных особенностях и традициях различных сообществ',
  'ИУК-5.2' : 'Демонстрирует уважительное отношение к историческому наследию и социокультурным традициям различных народов, основываясь на знании этапов исторического развития общества (включая основные события, деятельность основных исторических деятелей) и культурных традиций тира (включая мировые религии, философские и этические учения), в зависимости от среды взаимодействия и задач образования',
  'ИУК-5.3' : 'Умеет толерантно и конструктивно взаимодействовать с людьми с учетом их социокультурных особенностей в целях успешного выполнения профессиональных задач и усиления социальной интеграции',
  'ИУК-6.1' : 'Применяет рефлексивные методы в процессе оценки разнообразных ресурсов (личностных, психофизиологических, ситуативных, временных и т.д.), используемых для решения задач самоорганизации и саморазвития',
  'ИУК-6.2' : 'Определяет приоритеты собственной деятельности, выстраивает планы их достижения',
  'ИУК-6.3' : 'Формулирует цели собственной деятельности, определяет пути их достижения с учетом ресурсов, условий, средств, временной перспективы развития деятельности и планируемых результатов',
  'ИУК-6.4' : 'Критически оценивает эффективность использования времени и других ресурсов для совершенствования своей деятельности',
  'ИУК-6.5' : 'Демонстрирует интерес к учебе и использует предоставляемые возможности для приобретения новых знаний и навыков с целью совершенствования своей деятельности',
  'ИОПК-1.1' : 'Знает: приоритетные направления развития системы образования Российской Федерации, законы и иные нормативные правовые акты, регламентирующие деятельность в сфере образования в Российской Федерации',
  'ИОПК-1.2' : 'Умеет: применять основные нормативно-правовые акты в сфере образования и профессиональной деятельности с учетом норм профессиональной этики, выявлять актуальные проблемы в сфере образования с целью выполнения научного исследования',
  'ИОПК-1.3' : 'Владеет: действиями по соблюдению правовых, нравственных и этических норм, требований профессиональной этики в условиях реальных педагогических ситуаций; действиями по осуществлению профессиональной деятельности в соответствии с требованиями Федеральных государственных образовательных стандартов всех уровней образования',
  'ИОПК-2.1' : 'Знает: содержание основных нормативных документов, необходимых для проектирования ОП; сущность и методы педагогической диагностики особенностей обучающихся; сущность педагогического проектирования; структуру образовательной программы и требования к ней; виды и функции научно-методического обеспечения современного образовательного процесса',
  'ИОПК-2.2' : 'Умеет: учитывать различные контексты, в которых протекают процессы обучения, воспитания и социализации при проектировании ООП; использовать методы педагогической диагностики; осуществлять проектную деятельность по разработке ОП; проектировать отдельные структурные компоненты ООП',
  'ИОПК-2.3' : 'Владеет: опытом выявления различных контекстов, в которых протекают процессы обучения, воспитания и социализации; опытом использования методов диагностики особенностей учащихся в практике; способами проектной деятельности в образовании; опытом участия в проектировании ООП',
  'ИОПК-3.1' : 'Знает: основы применения образовательных технологий ( в том числе в условиях инклюзивного образовательного процесса), необходимых для адресной работы с различными категориями обучающихся, в том числе с особыми образовательными потребностями; особые приемы и типологию технологий индивидуализации обучения',
  'ИОПК-3.2' : 'Умеет: взаимодействовать с другими специалистами в процессе реализации образовательного процесса; соотносить виды адресной помощи с индивидуальными образовательными потребностями обучающихся на соответствующем уровне образования',
  'ИОПК-3.3' : 'Владеет: методами (первичного) выявления обучающихся с особыми образовательными потребностями; действиями оказания адресной помощи обучающимся на соответствующем уровне образования',
  'ИОПК-4.1' : 'Знает: общие принципы и подходы к реализации процесса воспитания; методы и приемы формирования ценностных ориентаций обучающихся, развития нравственных чувств (совести, долга, эмпатии, ответственности и др.), формирования нравственного облика (терпения, милосердия и др.), нравственной позиции (способность различать добро и зло, проявлять самоотверженность, готовности к преодолению жизненных испытаний), нравственного поведения; документы, регламентирующие содержание базовых национальных ценностей',
  'ИОПК-4.2' : 'Умеет: создавать воспитательные ситуации, содействующие становлению у обучающихся нравственной позиции, духовности, ценностного отношения к человеку',
  'ИОПК-4.3' : 'Владеет: методами и приемами становления нравственного отношения обучающихся к окружающей действительности; способами усвоения подрастающим поколением и претворением в практическое действие и поведение духовных ценностей (индивидуально-личностных, общечеловеческих, национальных, семейных и др.)',
  'ИОПК-5.1' : 'Знает: принципы организации контроля и оценивания образовательных результатов обучающихся, разработки программ мониторинга; специальные технологии и методы, позволяющие разрабатывать и реализовывать программы преодоления трудностей в обучении',
  'ИОПК-5.2' : 'Умеет: применять инструментарий и методы диагностики и оценки показателей уровня и динамики развития обучающихся; проводить педагогическую диагностику трудностей в обучении',
  'ИОПК-5.3' : 'Владеет: действиями применения методов контроля и оценки образовательных результатов обучающихся, программ мониторинга образовательных результатов обучающихся, оценки результатов их применения',
  'ИОПК-6.1' : 'Знает: психолого-педагогические основы учебной деятельности; принципы проектирования и особенности использования психолого-педагогических (в том числе инклюзивных) технологий в профессиональной деятельности с учетом личностных и возрастных особенностей обучающихся, в том числе с особыми образовательными потребностями',
  'ИОПК-6.2' : 'Умеет: использовать знания об особенностях развития обучающихся при планировании учебно-воспитательной работы; применять образовательные технологии для индивидуализации обучения, развития, воспитания обучающихся, в том числе с особыми образовательными потребностями',
  'ИОПК-6.3' : 'Владеет: навыками учета особенностей развития обучающихся в образовательном процессе; навыками отбора и использования психолого-педагогических (в том числе инклюзивных) технологий в профессиональной деятельности для индивидуализации обучения, развития, воспитания, в том числе обучающихся с особыми образовательными потребностями; навыками разработки и реализации индивидуальных образовательных маршрутов, индивидуально-ориентированных образовательных программ (совместно с другими субъектами образовательных отношений)',
  'ИОПК-7.1' : 'Знает: педагогические основы построения взаимодействия с субъектами образовательного процесса; методы выявления индивидуальных особенностей обучающихся; особенности построения взаимодействия с различными участниками образовательных отношений с учетом особенностей образовательной среды учреждения',
  'ИОПК-7.2' : 'Умеет: использовать особенности образовательной среды учреждения для реализации взаимодействия субъектов; составлять (совместно с другими специалистами) планы взаимодействия участников образовательных отношений; использовать для организации взаимодействия приемы организаторской деятельности',
  'ИОПК-7.3' : 'Владеет: технологиями взаимодействия и сотрудничества в образовательном процессе; способами решения проблем при взаимодействии с различным контингентом обучающихся; приемами индивидуального подхода к разным участникам образовательных отношений',
  'ИОПК-8.1' : 'Знает: особенности педагогической деятельности; требования к субъектам педагогической деятельности; результаты научных исследований для выбора методов в педагогической деятельности',
  'ИОПК-8.2' : 'Умеет: использовать современные специальные научные знания и результаты исследований для выбора методов в педагогической деятельности',
  'ИОПК-8.3' : 'Владеет: методами, формами и средствами педагогической деятельности; осуществляет их выбор в зависимости от контекста профессиональной деятельности с учетом результатов научных исследований',
  'ИПК-1.1' : 'Знает: особенности профессиональной деятельности в образовании; требования к профессиональной компетентности в сфере образования; пути и средства ее изучения и развития',
  'ИПК-1.2' : 'Умеет: решать профессиональные задачи с учетом различных контекстов; проектировать пути своего профессионального развития',
  'ИПК-1.3' : 'Владеет: приемами анализа и оценки собственной профессиональной деятельности, программ, механизмов и форм развития профессиональной компетентности на соответствующем уровне образования',
  'ИПК-2.1' : 'Знает: методологические основы исследовательской деятельности в образовании',
  'ИПК-2.2' : 'Умеет: работать в исследовательской команде, проектировать программы исследования в рамках выбранной проблематики, отбирать методологические основания и используемые методы педагогического исследования, источники информации',
  'ИПК-2.3' : 'Владеет: приемами организации работы проектной (исследовательской) команды для поиска и применения знаний в рамках выбранной проблематики с целью решения задач развития профессиональной деятельности',
  'ИПК-3.1' : 'Знает: требования ФГОС ВО и иные нормативные правовые акты, регламентирующие педагогическую деятельность в сфере высшего образования и  в системе дополнительного профессионального образования Российской Федерации; современные подходы к педагогическому проектированию и реализации образовательного процесса в высшей школе и в системе дополнительного профессионального образования;',
  'ИПК-3.2' : 'Знает: дидактические принципы, традиционные и современные образовательные технологии, методы, приемы и формы организации образовательного процесса в вузе и в системе дополнительного профессионального образования;  современные подходы к организации контроля и оценки промежуточных и итоговых результатов образования у обучающихся по программам высшего образования и дополнительного профессионального образования;',
  'ИПК-3.3' : 'Умеет: планировать содержание образования и учебно-методическое обеспечение, отбирать соответствующие образовательные технологии, оценочные средства, методы, приемы и формы организации образовательного процесса, в том числе в условиях цифрового образовательного процесса, в соответствии с планируемыми результатами образования и с учетом индивидуальных особенностей и запросов студентов.',
  'ИПК-3.4' : 'Умеет: организовывать взаимодействие представителей работодателей, педагогических работников при определении требований к результатам подготовки обучающихся; провести мониторинг образовательных потребностей обучающихся и их удовлетворенности качеством организации образовательного процесса в вузе',
  'ИПК-3.5' : 'Владеет: современными технологиями организации образовательного процесса в вузе, способствующими развитию компетенций у обучающихся; методиками разработки контрольно-оценочных средств; методами и приемами организации непрерывного контроля и оценки результатов образования у обучающихся по программам высшего образования и дополнительного профессионального образования.',
  'ИПК-4.1' : 'Знает: нормативно-правовые акты, определяющие современную государственную молодежную политику,',
  'ИПК-4.2' : 'Умеет:  проектировать педагогические условия для развития группы обучающихся в системе высшего образования;',
  'ИПК-4.3' : 'Умеет: оказывать педагогическое сопровождение обучающихся в удовлетворении их потребностей в интеллектуальном, культурном, нравственном развитии, профессиональном самоопределении, в выборе образовательной траектории, в планировании самостоятельной работы.',
  'ИПК-4.4' : 'Владеет: методами, формами, приемами и средствами организации и коррекции общения и деятельности обучающихся группы с учетом их возрастных и индивидуальных особенностей.',
  'ИПК-4.5' : 'Владеет: опытом педагогического проектирования индивидуальных образовательных траекторий обучающихся для формирования у них устойчивого, позитивного отношения к своей будущей профессии.',
  'ИПК-5.1' : 'Знает: особенности непрерывного профессионального саморазвития преподавателя вуза.',
  'ИПК-5.2' : 'Умеет: разрабатывать программу непрерывного профессионального саморазвития; учитывать и применять этические и правовые нормы при оценке последствий своей профессиональной деятельности.',
  'ИПК-5.3' : 'Владеет: приемами анализа, оценки и коррекции программы непрерывного профессионального саморазвития  преподавателя вуза.'
}

LINKS = {   #
  'Б1.О.01.01' : ['УК-1', 'ОПК-1', 'ОПК-5', 'ОПК-8', 'ПК-1'],
  'Б1.О.01.02' : ['УК-6', 'ОПК-8', 'ПК-2'],
  'Б1.О.01.03' : ['УК-1', 'УК-4', 'УК-6', 'ПК-2'],
  'Б1.О.01.04' : ['УК-4', 'ОПК-8', 'ПК-1'],
  'Б1.О.02.01' : ['УК-4', 'УК-5'],
  'Б1.О.02.02' : ['УК-4', 'ОПК-7'],
  'Б1.О.02.03' : ['УК-4', 'УК-5'],
  'Б1.О.03.01' : ['УК-2', 'УК-3'],
  'Б1.О.03.02' : ['ОПК-2', 'ОПК-3', 'ОПК-5'],
  'Б1.О.03.03' : ['ОПК-2', 'ОПК-6'],
  'Б1.О.03.04' : ['УК-2', 'ОПК-6'],
  'Б1.О.04.01' : ['УК-5', 'ОПК-1'],
  'Б1.О.04.02' : ['УК-5', 'ОПК-4', 'ОПК-6', 'ОПК-8'],
  'Б1.О.04.03' : ['УК-5', 'ОПК-4', 'ОПК-6', 'ОПК-8'],
  'Б1.В.01.01' : ['УК-1', 'ПК-3'],
  'Б1.В.01.02' : ['УК-6', 'ПК-1', 'ПК-5'],
  'Б1.В.01.03' : ['ПК-3 ', 'ПК-4'],
  'Б1.В.02.01' : ['ПК-3 ', 'ПК-5'],
  'Б1.В.02.02' : ['УК-3', 'ПК-5'],
  'Б1.В.03.01' : ['УК-6', 'ПК-3 ', 'ПК-4']
}

def get_name_module(code):
    if code in MODULES:
        return MODULES[code]
    else:
        return f"unknow module [{code}]"

def get_list_courses_module(code):
    ret_dict = {}
    if code in MODULES:
        for code_course in SUBJECTS.keys():
            if code_course[0:len(code)] == code:
                ret_dict[code_course] = SUBJECTS[code_course]
    return ret_dict

def get_name_course(code):
  if code in SUBJECTS:
    return SUBJECTS[code]
  else:
    return f"unknow course [{code}]"

def get_name_competence(code):
    if code in COMPETENCES:
        return COMPETENCES[code]
    else:
        return f"unknow competence [{code}]"

def get_name_indicator(code):
    if code in INDICATORS:
        return INDICATORS[code]
    else:
        return f"unknow indicator [{code}]"

def get_list_indicators_competence(code):
    ret_dict = {}
    if code in COMPETENCES:
        for code_indicator in INDICATORS.keys():
            if code_indicator[1:(len(code)+1)] == code:
                ret_dict[code_indicator] = INDICATORS[code_indicator]
    return ret_dict

def get_list_competences_course(code):
    if code in LINKS:
        return LINKS[code]
    else:
        return f"invalid course [{code}]"
